//
//  KomaInf.cpp
//  MySampleProject
//
//  Created by 小森久 on 2014/06/11.
//
//

#include "KomaInf.h"

int KomaValue[] = {
	//  空空空空空空空空空空空空空空空空空 歩  香  桂   銀   金   角   飛    王    と   杏  圭   全   金   馬   龍
	0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,100,600,700,1000,1200,1800,2000,10000,1200,1200,1200,1200,1200,2000,2200,
	//	空  歩   香   桂    銀    金    角    飛     王    と    杏    圭    全    金    馬    龍 壁
	0,-100,-600,-700,-1000,-1200,-1800,-2000,-10000,-1200,-1200,-1200,-1200,-1200,-2000,-2200,0
};

int HandValue[] = {
	//  空空空空空空空空空空空空空空空空空 歩  香  桂   銀   金   角   飛王と杏圭全金馬龍
	0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,105,630,735,1050,1260,1890,2100,0,0,0,0,0,0,0,0,
	//	空  歩   香   桂    銀    金    角    飛
	0,-105,-630,-735,-1050,-1260,-1890,-2100
};

int Direct[DIRECT_NUM]={
	17,1,-15,16,-16,15,-1,-17,14,-18,18,-14
};

int CanPromote[] = {
	//  空空空空空空空空空空空空空空空空空歩香桂銀金角飛王と杏圭全金馬龍
	0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,1,1,1,1,0,1,1,0,0,0,0,0,0,0,0,
	//	空歩香桂銀金角飛王と杏圭全金馬龍壁空空空空空空空空空空空空空空空
	0,1,1,1,1,0,1,1,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0
};

int CanMove[DIRECT_NUM][64]={
	{
		// Direct[0]=17,
		// |／
		//  ￣
		//  空空空空空空空空空空空空空空空空空歩香桂銀金角飛王と杏圭全金馬龍
		0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,1,0,0,0,1,0,0,0,0,0,0,1,
		//	空歩香桂銀金角飛王と杏圭全金馬龍壁空空空空空空空空空空空空空空空
		0,0,0,0,1,1,0,0,1,1,1,1,1,1,0,1,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0
	},{
		// Direct[0]=1,
		// ↓
		//  空空空空空空空空空空空空空空空空空歩香桂銀金角飛王と杏圭全金馬龍
		0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,1,0,0,1,1,1,1,1,1,1,0,
		//	空歩香桂銀金角飛王と杏圭全金馬龍壁空空空空空空空空空空空空空空空
		0,1,0,0,1,1,0,0,1,1,1,1,1,1,1,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0
	},{
		// Direct[0]=-15,
		// ＼|
		// ￣
		//  空空空空空空空空空空空空空空空空空歩香桂銀金角飛王と杏圭全金馬龍
		0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,1,0,0,0,1,0,0,0,0,0,0,1,
		//	空歩香桂銀金角飛王と杏圭全金馬龍壁空空空空空空空空空空空空空空空
		0,0,0,0,1,1,0,0,1,1,1,1,1,1,0,1,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0
	},{
		// Direct[0]=16,
		// ←
		//  空空空空空空空空空空空空空空空空空歩香桂銀金角飛王と杏圭全金馬龍
		0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,1,0,0,1,1,1,1,1,1,1,0,
		//	空歩香桂銀金角飛王と杏圭全金馬龍壁空空空空空空空空空空空空空空空
		0,0,0,0,0,1,0,0,1,1,1,1,1,1,1,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0
	},{
		// Direct[0]=-16,
		// →
		//  空空空空空空空空空空空空空空空空空歩香桂銀金角飛王と杏圭全金馬龍
		0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,1,0,0,1,1,1,1,1,1,1,0,
		//	空歩香桂銀金角飛王と杏圭全金馬龍壁空空空空空空空空空空空空空空空
		0,0,0,0,0,1,0,0,1,1,1,1,1,1,1,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0
	},{
		// Direct[0]=15,
		//  __
		// |＼
		//  空空空空空空空空空空空空空空空空空歩香桂銀金角飛王と杏圭全金馬龍
		0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,1,1,0,0,1,1,1,1,1,1,0,1,
		//	空歩香桂銀金角飛王と杏圭全金馬龍壁空空空空空空空空空空空空空空空
		0,0,0,0,1,0,0,0,1,0,0,0,0,0,0,1,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0
	},{
		// Direct[0]=-1,
		// ↑
		//  空空空空空空空空空空空空空空空空空歩香桂銀金角飛王と杏圭全金馬龍
		0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,1,0,0,1,1,0,0,1,1,1,1,1,1,1,0,
		//	空歩香桂銀金角飛王と杏圭全金馬龍壁空空空空空空空空空空空空空空空
		0,0,0,0,0,1,0,0,1,1,1,1,1,1,1,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0
	},{
		// Direct[0]=-17
		// __
		// ／|
		//  空空空空空空空空空空空空空空空空空歩香桂銀金角飛王と杏圭全金馬龍
		0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,1,1,0,0,1,1,1,1,1,1,0,1,
		//	空歩香桂銀金角飛王と杏圭全金馬龍壁空空空空空空空空空空空空空空空
		0,0,0,0,1,0,0,0,1,0,0,0,0,0,0,1,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0
	},{
		// Direct[0]=14,先手の桂馬
		//  空空空空空空空空空空空空空空空空空歩香桂銀金角飛王と杏圭全金馬龍
		0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,1,0,0,0,0,0,0,0,0,0,0,0,0,
		//	空歩香桂銀金角飛王と杏圭全金馬龍壁空空空空空空空空空空空空空空空
		0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0
	},{
		// Direct[0]=-18,先手の桂馬
		//  空空空空空空空空空空空空空空空空空歩香桂銀金角飛王と杏圭全金馬龍
		0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,1,0,0,0,0,0,0,0,0,0,0,0,0,
		//	空歩香桂銀金角飛王と杏圭全金馬龍壁空空空空空空空空空空空空空空空
		0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0
	},{
		// Direct[0]=-14,後手の桂馬
		//  空空空空空空空空空空空空空空空空空歩香桂銀金角飛王と杏圭全金馬龍
		0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,
		//	空歩香桂銀金角飛王と杏圭全金馬龍壁空空空空空空空空空空空空空空空
		0,0,0,1,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0
	},{
		// Direct[0]=18,後手の桂馬
		//  空空空空空空空空空空空空空空空空空歩香桂銀金角飛王と杏圭全金馬龍
		0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,
		//	空歩香桂銀金角飛王と杏圭全金馬龍壁空空空空空空空空空空空空空空空
		0,0,0,1,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0
	}
};

int CanJump[DIRECT_NUM][64]={
	// Direct[0]=17,
	// ＼|
	// ￣
	{
		//  空空空空空空空空空空空空空空空空空歩香桂銀金角飛王と杏圭全金馬龍
		0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,1,0,0,0,0,0,0,0,1,0,
		//	空歩香桂銀金角飛王と杏圭全金馬龍壁空空空空空空空空空空空空空空空
		0,0,0,0,0,0,1,0,0,0,0,0,0,0,1,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0
	},{
		// Direct[0]=1,
		// ↓
		//  空空空空空空空空空空空空空空空空空歩香桂銀金角飛王と杏圭全金馬龍
		0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,1,0,0,0,0,0,0,0,1,
		//	空歩香桂銀金角飛王と杏圭全金馬龍壁空空空空空空空空空空空空空空空
		0,0,1,0,0,0,0,1,0,0,0,0,0,0,0,1,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0
	},{
		// Direct[0]=-15,
		// ＼|
		// ￣
		//  空空空空空空空空空空空空空空空空空歩香桂銀金角飛王と杏圭全金馬龍
		0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,1,0,0,0,0,0,0,0,1,0,
		//	空歩香桂銀金角飛王と杏圭全金馬龍壁空空空空空空空空空空空空空空空
		0,0,0,0,0,0,1,0,0,0,0,0,0,0,1,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0
	},{
		// Direct[0]=16,
		// ←
		//  空空空空空空空空空空空空空空空空空歩香桂銀金角飛王と杏圭全金馬龍
		0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,1,0,0,0,0,0,0,0,1,
		//	空歩香桂銀金角飛王と杏圭全金馬龍壁空空空空空空空空空空空空空空空
		0,0,0,0,0,0,0,1,0,0,0,0,0,0,0,1,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0
	},{
		// Direct[0]=-16,
		// →
		//  空空空空空空空空空空空空空空空空空歩香桂銀金角飛王と杏圭全金馬龍
		0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,1,0,0,0,0,0,0,0,1,
		//	空歩香桂銀金角飛王と杏圭全金馬龍壁空空空空空空空空空空空空空空空
		0,0,0,0,0,0,0,1,0,0,0,0,0,0,0,1,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0
	},{
		// Direct[0]=15,
		//  __
		// |＼
		//  空空空空空空空空空空空空空空空空空歩香桂銀金角飛王と杏圭全金馬龍
		0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,1,0,0,0,0,0,0,0,1,0,
		//	空歩香桂銀金角飛王と杏圭全金馬龍壁空空空空空空空空空空空空空空空
		0,0,0,0,0,0,1,0,0,0,0,0,0,0,1,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0
	},{
		// Direct[0]=-1,
		// ↑
		//  空空空空空空空空空空空空空空空空空歩香桂銀金角飛王と杏圭全金馬龍
		0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,1,0,0,0,0,1,0,0,0,0,0,0,0,1,
		//	空歩香桂銀金角飛王と杏圭全金馬龍壁空空空空空空空空空空空空空空空
		0,0,0,0,0,0,0,1,0,0,0,0,0,0,0,1,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0
	},{
		// Direct[0]=-17
		// __
		// ／|
		//  空空空空空空空空空空空空空空空空空歩香桂銀金角飛王と杏圭全金馬龍
		0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,1,0,0,0,0,0,0,0,1,0,
		//	空歩香桂銀金角飛王と杏圭全金馬龍壁空空空空空空空空空空空空空空空
		0,0,0,0,0,0,1,0,0,0,0,0,0,0,1,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0
	},{
		// Direct[0]=14,先手の桂馬飛び
		//  空空空空空空空空空空空空空空空空空歩香桂銀金角飛王と杏圭全金馬龍
		0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,
		//	空歩香桂銀金角飛王と杏圭全金馬龍壁空空空空空空空空空空空空空空空
		0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0
	},{
		// Direct[0]=-18,先手の桂馬飛び
		//  空空空空空空空空空空空空空空空空空歩香桂銀金角飛王と杏圭全金馬龍
		0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,
		//	空歩香桂銀金角飛王と杏圭全金馬龍壁空空空空空空空空空空空空空空空
		0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0
	},{
		// Direct[0]=-14,後手の桂馬飛び
		//  空空空空空空空空空空空空空空空空空歩香桂銀金角飛王と杏圭全金馬龍
		0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,
		//	空歩香桂銀金角飛王と杏圭全金馬龍壁空空空空空空空空空空空空空空空
		0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0
	},{
		// Direct[0]=18,後手の桂馬飛び
		//  空空空空空空空空空空空空空空空空空歩香桂銀金角飛王と杏圭全金馬龍
		0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,
		//	空歩香桂銀金角飛王と杏圭全金馬龍壁空空空空空空空空空空空空空空空
		0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0
	}
};

